IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MAILBOX0_MAILBOX_CLUSTER_5_REGS5.xml
<module name="MAILBOX0_MAILBOX_CLUSTER_5_REGS5" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="REGS5_MAILBOX_ID" acronym="REGS5_MAILBOX_ID" offset="0x0" width="32" description="This is the standard TI peripheral ID register that exists at address 0 in the peripheral space">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Used to distinguish which ID numbering scheme is used." range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="BU identifier" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNCTION" width="12" begin="27" end="16" resetval="0x1788" description="Module family." range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL_VER" width="5" begin="15" end="11" resetval="0x17" description="RTL version. R of X.Y.R.Z" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR_REV" width="3" begin="10" end="8" resetval="0x1" description="Major revision. X of X.Y.R.Z" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Special version number" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR_REV" width="6" begin="5" end="0" resetval="0x0" description="Minor revision. Y of X.Y.R.Z" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="REGS5_MAILBOX_SYSCONFIG" acronym="REGS5_MAILBOX_SYSCONFIG" offset="0x10" width="32" description="This register contains parameters to control the whole Mailbox system. Provided for backwards compatibility with OMAP Mailbox. Only contains the soft reset.">
		<bitfield id="SOFT_RESET" width="1" begin="0" end="0" resetval="0x0" description="Module Software Reset The bit is automatically reset by the hardware. During reads, it always returns 0. It has the same effect as the hardware reset. Writing a 0 has no effect. Writing a 1 will start a soft reset sequence and empty all the mailboxes" range="0" rwaccess="R/W"/>
	</register>
	<register id="REGS5_MAILBOX_MESSAGE" acronym="REGS5_MAILBOX_MESSAGE" offset="0x40" width="32" description="The message register stores the next to-be-read message of the mailbox. 
Read: Reads the next available message. 
Write: Add a message to this mailbox queue.">
		<bitfield id="MESSAGE_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Message in Mailbox [a]" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS5_MAILBOX_FIFOSTATUS" acronym="REGS5_MAILBOX_FIFOSTATUS" offset="0x80" width="32" description="The FIFO status register has the status of the Mailbox[a] FIFO">
		<bitfield id="FIFO_FULL" width="1" begin="0" end="0" resetval="0x0" description="Full flag for Mailbox m" range="0" rwaccess="R"/>
	</register>
	<register id="REGS5_MAILBOX_MSGSTATUS" acronym="REGS5_MAILBOX_MSGSTATUS" offset="0xC0" width="32" description="The message status register has the status of the messages in Mailbox[a]">
		<bitfield id="NUM_MESSAGES" width="3" begin="2" end="0" resetval="0x0" description="Number of messages in Mailbox[a]" range="2 - 0" rwaccess="R"/>
	</register>
	<register id="REGS5_MAILBOX_IRQ_EOI" acronym="REGS5_MAILBOX_IRQ_EOI" offset="0x140" width="32" description="This is the EOI register with which the software is enabled to do the interrupt clearance.">
		<bitfield id="EOI3" width="1" begin="3" end="3" resetval="0x0" description="Software EOI signal for the user 3 interrupt" range="3" rwaccess="W"/> 
		<bitfield id="EOI2" width="1" begin="2" end="2" resetval="0x0" description="Software EOI signal for the user 2 interrupt" range="2" rwaccess="W"/> 
		<bitfield id="EOI1" width="1" begin="1" end="1" resetval="0x0" description="Software EOI signal for the user 1 interrupt" range="1" rwaccess="W"/> 
		<bitfield id="EOI0" width="1" begin="0" end="0" resetval="0x0" description="Software EOI signal for the user 0 interrupt" range="0" rwaccess="W"/>
	</register>
	<register id="REGS5_MAILBOX_IRQ_STATUS_RAW" acronym="REGS5_MAILBOX_IRQ_STATUS_RAW" offset="0x100" width="32" description="The interrupt status register has the status for each event that may be responsible for the generation of an interrupt to the corresponding user .
Software may also write 1 to a given bit to set this bit to test interrupt generation. It will activate the status bit for two cycles. This may still be masked, however. Write 0 has no effect.">
		<bitfield id="NOTFULLSTATUSMB15" width="1" begin="31" end="31" resetval="0x1" description="1 if Mailbox 15 is not full" range="31" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB15" width="1" begin="30" end="30" resetval="0x0" description="1 if there are messages present in Mailbox 15" range="30" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB14" width="1" begin="29" end="29" resetval="0x1" description="1 if Mailbox 14 is not full" range="29" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB14" width="1" begin="28" end="28" resetval="0x0" description="1 if there are messages present in Mailbox 14" range="28" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB13" width="1" begin="27" end="27" resetval="0x1" description="1 if Mailbox 13 is not full" range="27" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB13" width="1" begin="26" end="26" resetval="0x0" description="1 if there are messages present in Mailbox 13" range="26" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB12" width="1" begin="25" end="25" resetval="0x1" description="1 if Mailbox 12 is not full" range="25" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB12" width="1" begin="24" end="24" resetval="0x0" description="1 if there are messages present in Mailbox 12" range="24" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB11" width="1" begin="23" end="23" resetval="0x1" description="1 if Mailbox 11 is not full" range="23" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB11" width="1" begin="22" end="22" resetval="0x0" description="1 if there are messages present in Mailbox 11" range="22" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB10" width="1" begin="21" end="21" resetval="0x1" description="1 if Mailbox 10 is not full" range="21" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB10" width="1" begin="20" end="20" resetval="0x0" description="1 if there are messages present in Mailbox 10" range="20" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB9" width="1" begin="19" end="19" resetval="0x1" description="1 if Mailbox 9 is not full" range="19" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB9" width="1" begin="18" end="18" resetval="0x0" description="1 if there are messages present in Mailbox 9" range="18" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB8" width="1" begin="17" end="17" resetval="0x1" description="1 if Mailbox 8 is not full" range="17" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB8" width="1" begin="16" end="16" resetval="0x0" description="1 if there are messages present in Mailbox 8" range="16" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB7" width="1" begin="15" end="15" resetval="0x1" description="1 if Mailbox 7 is not full" range="15" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB7" width="1" begin="14" end="14" resetval="0x0" description="1 if there are messages present in Mailbox 7" range="14" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB6" width="1" begin="13" end="13" resetval="0x1" description="1 if Mailbox 6 is not full" range="13" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB6" width="1" begin="12" end="12" resetval="0x0" description="1 if there are messages present in Mailbox 6" range="12" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB5" width="1" begin="11" end="11" resetval="0x1" description="1 if Mailbox 5 is not full" range="11" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB5" width="1" begin="10" end="10" resetval="0x0" description="1 if there are messages present in Mailbox 5" range="10" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB4" width="1" begin="9" end="9" resetval="0x1" description="1 if Mailbox 4 is not full" range="9" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB4" width="1" begin="8" end="8" resetval="0x0" description="1 if there are messages present in Mailbox 4" range="8" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB3" width="1" begin="7" end="7" resetval="0x1" description="1 if Mailbox 3 is not full" range="7" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB3" width="1" begin="6" end="6" resetval="0x0" description="1 if there are messages present in Mailbox 3" range="6" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB2" width="1" begin="5" end="5" resetval="0x1" description="1 if Mailbox 2 is not full" range="5" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB2" width="1" begin="4" end="4" resetval="0x0" description="1 if there are messages present in Mailbox 2" range="4" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB1" width="1" begin="3" end="3" resetval="0x1" description="1 if Mailbox 1 is not full" range="3" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB1" width="1" begin="2" end="2" resetval="0x0" description="1 if there are messages present in Mailbox 1" range="2" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB0" width="1" begin="1" end="1" resetval="0x1" description="1 if Mailbox 0 is not full" range="1" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB0" width="1" begin="0" end="0" resetval="0x0" description="1 if there are messages present in Mailbox 0" range="0" rwaccess="R/W"/>
	</register>
	<register id="REGS5_MAILBOX_IRQ_STATUS_CLR" acronym="REGS5_MAILBOX_IRQ_STATUS_CLR" offset="0x104" width="32" description="The interrupt status register has the status for each event that may be responsible for the generation of an interrupt to the corresponding user combined with the corresponding MASK information.
Software may also write 1 to a given bit to clear this bit. However, if the hardware still has pending, enabled events, the interrupt will fire again in two cycles.
Write 0 has no effect.">
		<bitfield id="NOTFULLSTATUSMB15" width="1" begin="31" end="31" resetval="0x0" description="1 if Mailbox 15 is not full and this interrupt bit is enabled" range="31" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB15" width="1" begin="30" end="30" resetval="0x0" description="1 if there are messages present in Mailbox 15 and this interrupt bit is enabled" range="30" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB14" width="1" begin="29" end="29" resetval="0x0" description="1 if Mailbox 14 is not full and this interrupt bit is enabled" range="29" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB14" width="1" begin="28" end="28" resetval="0x0" description="1 if there are messages present in Mailbox 14 and this interrupt bit is enabled" range="28" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB13" width="1" begin="27" end="27" resetval="0x0" description="1 if Mailbox 13 is not full and this interrupt bit is enabled" range="27" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB13" width="1" begin="26" end="26" resetval="0x0" description="1 if there are messages present in Mailbox 13 and this interrupt bit is enabled" range="26" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB12" width="1" begin="25" end="25" resetval="0x0" description="1 if Mailbox 12 is not full and this interrupt bit is enabled" range="25" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB12" width="1" begin="24" end="24" resetval="0x0" description="1 if there are messages present in Mailbox 12 and this interrupt bit is enabled" range="24" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB11" width="1" begin="23" end="23" resetval="0x0" description="1 if Mailbox 11 is not full and this interrupt bit is enabled" range="23" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB11" width="1" begin="22" end="22" resetval="0x0" description="1 if there are messages present in Mailbox 11 and this interrupt bit is enabled" range="22" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB10" width="1" begin="21" end="21" resetval="0x0" description="1 if Mailbox 10 is not full and this interrupt bit is enabled" range="21" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB10" width="1" begin="20" end="20" resetval="0x0" description="1 if there are messages present in Mailbox 10 and this interrupt bit is enabled" range="20" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB9" width="1" begin="19" end="19" resetval="0x0" description="1 if Mailbox 9 is not full and this interrupt bit is enabled" range="19" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB9" width="1" begin="18" end="18" resetval="0x0" description="1 if there are messages present in Mailbox 9 and this interrupt bit is enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB8" width="1" begin="17" end="17" resetval="0x0" description="1 if Mailbox 8 is not full and this interrupt bit is enabled" range="17" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB8" width="1" begin="16" end="16" resetval="0x0" description="1 if there are messages present in Mailbox 8 and this interrupt bit is enabled" range="16" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB7" width="1" begin="15" end="15" resetval="0x0" description="1 if Mailbox 7 is not full and this interrupt bit is enabled" range="15" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB7" width="1" begin="14" end="14" resetval="0x0" description="1 if there are messages present in Mailbox 7 and this interrupt bit is enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB6" width="1" begin="13" end="13" resetval="0x0" description="1 if Mailbox 6 is not full and this interrupt bit is enabled" range="13" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB6" width="1" begin="12" end="12" resetval="0x0" description="1 if there are messages present in Mailbox 6 and this interrupt bit is enabled" range="12" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB5" width="1" begin="11" end="11" resetval="0x0" description="1 if Mailbox 5 is not full and this interrupt bit is enabled" range="11" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB5" width="1" begin="10" end="10" resetval="0x0" description="1 if there are messages present in Mailbox 5 and this interrupt bit is enabled" range="10" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB4" width="1" begin="9" end="9" resetval="0x0" description="1 if Mailbox 4 is not full and this interrupt bit is enabled" range="9" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB4" width="1" begin="8" end="8" resetval="0x0" description="1 if there are messages present in Mailbox 4 and this interrupt bit is enabled" range="8" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB3" width="1" begin="7" end="7" resetval="0x0" description="1 if Mailbox 3 is not full and this interrupt bit is enabled" range="7" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB3" width="1" begin="6" end="6" resetval="0x0" description="1 if there are messages present in Mailbox 3 and this interrupt bit is enabled" range="6" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB2" width="1" begin="5" end="5" resetval="0x0" description="1 if Mailbox 2 is not full and this interrupt bit is enabled" range="5" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB2" width="1" begin="4" end="4" resetval="0x0" description="1 if there are messages present in Mailbox 2 and this interrupt bit is enabled" range="4" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB1" width="1" begin="3" end="3" resetval="0x0" description="1 if Mailbox 1 is not full and this interrupt bit is enabled" range="3" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB1" width="1" begin="2" end="2" resetval="0x0" description="1 if there are messages present in Mailbox 1 and this interrupt bit is enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="NOTFULLSTATUSMB0" width="1" begin="1" end="1" resetval="0x0" description="1 if Mailbox 0 is not full and this interrupt bit is enabled" range="1" rwaccess="R/W"/> 
		<bitfield id="NEWMSGSTATUSMB0" width="1" begin="0" end="0" resetval="0x0" description="1 if there are messages present in Mailbox 0 and this interrupt bit is enabled" range="0" rwaccess="R/W"/>
	</register>
	<register id="REGS5_MAILBOX_IRQ_ENABLE_SET" acronym="REGS5_MAILBOX_IRQ_ENABLE_SET" offset="0x108" width="32" description="The interrupt enable register allows software to mask/unmask the module internal source of interrupt for the user [a].
Read value is the current enable bits for each interrupt source.
Write 1 to a bit enables an interrupt source. 
Write 0 has no effect.">
		<bitfield id="NOTFULLENABLEMB15" width="1" begin="31" end="31" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="31" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB15" width="1" begin="30" end="30" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="30" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB14" width="1" begin="29" end="29" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="29" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB14" width="1" begin="28" end="28" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="28" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB13" width="1" begin="27" end="27" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="27" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB13" width="1" begin="26" end="26" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="26" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB12" width="1" begin="25" end="25" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="25" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB12" width="1" begin="24" end="24" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="24" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB11" width="1" begin="23" end="23" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="23" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB11" width="1" begin="22" end="22" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="22" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB10" width="1" begin="21" end="21" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="21" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB10" width="1" begin="20" end="20" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="20" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB9" width="1" begin="19" end="19" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="19" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB9" width="1" begin="18" end="18" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="18" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB8" width="1" begin="17" end="17" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="17" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB8" width="1" begin="16" end="16" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="16" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB7" width="1" begin="15" end="15" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="15" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB7" width="1" begin="14" end="14" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="14" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB6" width="1" begin="13" end="13" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="13" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB6" width="1" begin="12" end="12" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="12" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB5" width="1" begin="11" end="11" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="11" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB5" width="1" begin="10" end="10" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="10" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB4" width="1" begin="9" end="9" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="9" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB4" width="1" begin="8" end="8" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="8" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB3" width="1" begin="7" end="7" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="7" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB3" width="1" begin="6" end="6" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="6" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB2" width="1" begin="5" end="5" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="5" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB2" width="1" begin="4" end="4" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="4" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB1" width="1" begin="3" end="3" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="3" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB1" width="1" begin="2" end="2" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="2" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB0" width="1" begin="1" end="1" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="1" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB0" width="1" begin="0" end="0" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 enables the interrupt. Write 0 does nothing." range="0" rwaccess="R/W"/>
	</register>
